app/controllers/api/sales_controller.rb

SELECT "sales".* FROM "sales"
---
    def index
      sales = Sale.all

INSERT INTO "sales" ("title", "client_name", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Sale title"], ["client_name", "Foo"], ["value", 10000], ["created_at", "2018-10-19 22:46:28.382974"], ["updated_at", "2018-10-19 22:46:28.382974"]]
INSERT INTO "sale_logs" ("sale_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sale_id", 90], ["status", "contact"], ["created_at", "2018-10-20 19:14:54"], ["updated_at", "2018-10-20 19:14:54"]]
---
    def create
      sale = Sale.new(create_params)

      if sale.save
        # FIXME: Problema de autoload do listener
        # publish(:sale_status_changed, sale)
        SaleLog.create(sale: sale, status: sale.status)

SELECT  "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
UPDATE "sales" SET "title" = $1, "value" = $2, "updated_at" = $3 WHERE "sales"."id" = $4  [["title", "Other Title"], ["value", 20000], ["updated_at", "2018-10-20 00:06:05.618650"], ["id", 117]]
---
    def update
      sale = Sale.find(params[:id])

      if sale.update(update_params)